DataProcessors/НеотгруженныеТоварыСтороннихСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>НеотгруженныеТоварыСтороннихСкладов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ОтветственныеЛицаОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизации</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИОВДательномПадеже</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныКорректировкиСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказПоставщика</Name>
					<Comment>!не используется с 09 февраля 2016</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныЗакрытияЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ) Процент скидки (если данная скидка детализируется по позициям номенклатуры, то является значением по умолчанию)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентАвтоматическихСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеАвтоматическойСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеУсловияАвтоматическойСкидки</Name>
					<Comment>(Общ) Значение условия скидки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТолькоРезерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыГотовыеКСборке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыГотовыеКСборке</Name>
			<Comment>Товары, готовые получены по заказу покупателя, но ещё НЕ НАЗНАЧЕННЫЕ к сборке ("Доставка" не приказала их собирать)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроблемнаяЯчейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КатегорииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КатегорииОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/НеотгруженныеТоварыСтороннихСкладов/Ext/ObjectModule.bsl
Перем Почта;
Перем УчетнаяЗапись;

Функция  ПолучитьЗапрос(ПромДата)
	
	ЗапросТоваров = Новый Запрос;
	ЗапросТоваров.УстановитьПараметр("ДатаПроверки", ПромДата);
	ЗапросТоваров.Текст =
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо
	|ПОМЕСТИТЬ ОсновнаяОрганизация
	|ИЗ
	|	Константы КАК Константы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизации.Руководитель)) КАК ОтветственныеЛицаОрганизацииСрезПоследних
	|		ПО Константы.ОсновнаяОрганизация = ОтветственныеЛицаОрганизацииСрезПоследних.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПокупателейОстатки.Номенклатура,
	|	ЗаказыПокупателейОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗаказыПокупателейОстатки.КоличествоОстаток КАК ОстатокЗаказано,
	|	ТоварыГотовыеКСборкеОстаткиИОбороты.КоличествоКонечныйОстаток КАК ОстатокКСборке,
	|	ЗаказыПокупателейОстатки.СуммаВзаиморасчетовОстаток,
	|	ЗаказыПокупателейОстатки.ЗаказПокупателя.СпособДоставки КАК СпособДоставки
	|ПОМЕСТИТЬ Неотгружено
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(, НЕ ЗаказПокупателя.IDСклада_СтороннийСклад = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)) КАК ЗаказыПокупателейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыГотовыеКСборке.ОстаткиИОбороты(, , , , НЕ ЗаказПокупателя.IDЗаказаПортал = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)) КАК ТоварыГотовыеКСборкеОстаткиИОбороты
	|		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ТоварыГотовыеКСборкеОстаткиИОбороты.ЗаказПокупателя
	|			И ЗаказыПокупателейОстатки.Номенклатура = ТоварыГотовыеКСборкеОстаткиИОбороты.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(ТоварыГотовыеКСборкеОстаткиИОбороты.КоличествоКонечныйОстаток, 0) >= 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Неотгружено.Номенклатура,
	|	Неотгружено.ЗаказПокупателя,
	|	Неотгружено.ОстатокЗаказано,
	|	Неотгружено.ОстатокКСборке,
	|	Неотгружено.СуммаВзаиморасчетовОстаток КАК СуммаОстаток,
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	Неотгружено.СпособДоставки
	|ПОМЕСТИТЬ НеотгруженоСПТУ
	|ИЗ
	|	Неотгружено КАК Неотгружено
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО Неотгружено.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
	|			И Неотгружено.ЗаказПокупателя = ПоступлениеТоваровУслугТовары.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеотгруженоСПТУ.ЗаказПокупателя.Контрагент КАК Контрагент,
	|	НеотгруженоСПТУ.ЗаказПокупателя.Грузополучатель КАК Филиал,
	|	НеотгруженоСПТУ.ЗаказПокупателя,
	|	НеотгруженоСПТУ.ЗаказПокупателя.ДатаОтгрузки КАК ДатаОтгрузки,
	|	НеотгруженоСПТУ.Номенклатура.Родитель КАК Производитель,
	|	НеотгруженоСПТУ.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	НеотгруженоСПТУ.Номенклатура,
	|	НеотгруженоСПТУ.ОстатокЗаказано КАК КоличествоОстаток,
	|	НеотгруженоСПТУ.СуммаОстаток,
	|	ТоварыВЯчейкахОстаткиИОбороты.Период КАК Оприходованно,
	|	ЕСТЬNULL(НеотгруженоСПТУ.ЗаказПокупателя.Грузополучатель.ОсновнойМенеджерПокупателя.ФизЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ОсновнойМенеджер,
	|	ВЫБОР
	|		КОГДА НеотгруженоСПТУ.ЗаказПокупателя.Грузополучатель.ОсновнойМенеджерПокупателя.ФизЛицо = НеотгруженоСПТУ.ЗаказПокупателя.Грузополучатель.МенеджерМСК
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|		ИНАЧЕ НеотгруженоСПТУ.ЗаказПокупателя.Грузополучатель.МенеджерМСК
	|	КОНЕЦ КАК АссистентТП,
	|	НеотгруженоСПТУ.СпособДоставки
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	НеотгруженоСПТУ КАК НеотгруженоСПТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.ОстаткиИОбороты(
	|				,
	|				,
	|				Регистратор,
	|				,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						НеотгруженоСПТУ.Номенклатура
	|					ИЗ
	|						НеотгруженоСПТУ КАК НеотгруженоСПТУ)) КАК ТоварыВЯчейкахОстаткиИОбороты
	|		ПО НеотгруженоСПТУ.Ссылка = ТоварыВЯчейкахОстаткиИОбороты.Регистратор.ДокументОснование
	|			И НеотгруженоСПТУ.Номенклатура = ТоварыВЯчейкахОстаткиИОбороты.Номенклатура
	|ГДЕ
	|	ТоварыВЯчейкахОстаткиИОбороты.Период < &ДатаПроверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновнаяОрганизация.ФизическоеЛицо КАК РуководительОрганизации,
	|	ВЫБОР
	|		КОГДА ИтоговаяТаблица.ОсновнойМенеджер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ИтоговаяТаблица.АссистентТП
	|		ИНАЧЕ ИтоговаяТаблица.ОсновнойМенеджер
	|	КОНЕЦ КАК Ответственный,
	|	ИтоговаяТаблица.Контрагент,
	|	ИтоговаяТаблица.Филиал,
	|	ИтоговаяТаблица.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ИтоговаяТаблица.ДатаОтгрузки,
	|	ИтоговаяТаблица.Производитель,
	|	ИтоговаяТаблица.КодПроизводителя,
	|	ИтоговаяТаблица.Номенклатура,
	|	ИтоговаяТаблица.КоличествоОстаток,
	|	ИтоговаяТаблица.СуммаОстаток,
	|	ИтоговаяТаблица.Оприходованно,
	|	ИтоговаяТаблица.СпособДоставки
	|ПОМЕСТИТЬ ТаблицаОтправки
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица,
	|	ОсновнаяОрганизация КАК ОсновнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОтправки.РуководительОрганизации КАК РуководительОрганизации,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(100)) КАК АдресЭлПочты,
	|	ТаблицаОтправки.Ответственный КАК Ответственный,
	|	ТаблицаОтправки.Контрагент,
	|	ТаблицаОтправки.Филиал,
	|	ТаблицаОтправки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаОтправки.ДатаОтгрузки,
	|	ТаблицаОтправки.Производитель,
	|	ТаблицаОтправки.КодПроизводителя,
	|	ТаблицаОтправки.Номенклатура,
	|	ТаблицаОтправки.КоличествоОстаток,
	|	ТаблицаОтправки.СуммаОстаток,
	|	ТаблицаОтправки.Оприходованно,
	|	ТаблицаОтправки.СпособДоставки
	|ИЗ
	|	ТаблицаОтправки КАК ТаблицаОтправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|			ПО КонтактнаяИнформация.Объект = КатегорииОбъектов.Объект
	|				И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.УведомлениеОНеотгруженныхТоварахСтороннихСкладов))
	|		ПО ТаблицаОтправки.РуководительОрганизации = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMailРабочийФизическогоЛица))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОтправки.Ответственный КАК Ответственный,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(100)) КАК АдресЭлПочты,
	|	ТаблицаОтправки.Контрагент,
	|	ТаблицаОтправки.Филиал,
	|	ТаблицаОтправки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаОтправки.ДатаОтгрузки,
	|	ТаблицаОтправки.Производитель,
	|	ТаблицаОтправки.КодПроизводителя,
	|	ТаблицаОтправки.Номенклатура,
	|	ТаблицаОтправки.КоличествоОстаток,
	|	ТаблицаОтправки.СуммаОстаток,
	|	ТаблицаОтправки.Оприходованно,
	|	ТаблицаОтправки.СпособДоставки
	|ИЗ
	|	ТаблицаОтправки КАК ТаблицаОтправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|			ПО КонтактнаяИнформация.Объект = КатегорииОбъектов.Объект
	|				И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.УведомлениеОНеотгруженныхТоварахСтороннихСкладов))
	|		ПО ТаблицаОтправки.Ответственный = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMailРабочийФизическогоЛица))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ответственный,
	|	ЗаказПокупателя
	|ИТОГИ
	|	МАКСИМУМ(АдресЭлПочты)
	|ПО
	|	Ответственный";
	
	Возврат ЗапросТоваров;

КонецФункции		

Процедура СформироватьОтчет(ДатаОтчета) Экспорт
	
	ЗапросТоваров = ПолучитьЗапрос(ДатаОтчета); 
	ДанныеДляОтчета = ЗапросТоваров.ВыполнитьПакет()[5].Выгрузить();
	
	Если НЕ ДанныеДляОтчета.Количество() = 0 Тогда
		
		МакетОтчета = ЭтотОбъект.ПолучитьМакет("Макет");
		ТекБаза = Константы.База.Получить();
		
		ТаблДокРуководителя = Новый ТабличныйДокумент; 
		ШапкаОтчета = МакетОтчета.ПолучитьОбласть("ШапкаОтчета");
		ШапкаОтчета.Параметры.Филиал = СокрЛП(ТекБаза); 
		ШапкаОтчета.Параметры.ДатаОтчета = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
		ТаблДокРуководителя.Вывести(ШапкаОтчета);
		
		Для Каждого СтрокаРезультата Из ДанныеДляОтчета Цикл
			
			СтрокаОтчета = МакетОтчета.ПолучитьОбласть("СтрокаОтчета");
			СтрокаОтчета.Параметры.Заполнить(СтрокаРезультата);
			ТаблДокРуководителя.Вывести(СтрокаОтчета);			
			
		КонецЦикла;		
		
		ТаблДокРуководителя.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТаблДокРуководителя.АвтоМасштаб = Истина;
		ТаблДокРуководителя.Показать();	
		
	КонецЕсли;	

КонецПроцедуры

Процедура СформироватьРегламентом() Экспорт 
	
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();	
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	Почта = Новый ИнтернетПочта; 	
	
	Попытка
		
		Почта.Подключиться(Профиль);
		УдалосьПодключиться = Истина;
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Отправка отчета по неотгруженным товарам сторонних складов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось подключиться к почтовому серверу");
		Возврат;
		
	КонецПопытки;
	
	МакетОтчета = ЭтотОбъект.ПолучитьМакет("Макет");
	ТекБаза = Константы.База.Получить();
	
	//Отправим сводный отчет руководителю филиала
	ЗапросТоваров = ПолучитьЗапрос(НачалоДня(ТекущаяДата() - 86400 * 3));
	ДанныеДляОтчетаРуководителю = ЗапросТоваров.ВыполнитьПакет()[5].Выгрузить();
	
	Если НЕ ДанныеДляОтчетаРуководителю.Количество() = 0 Тогда
		
		Если ЗначениеЗаполнено(ДанныеДляОтчетаРуководителю[0].АдресЭлПочты) Тогда			
			
			ТаблДокРуководителя = Новый ТабличныйДокумент;
			
			ШапкаОтчета = МакетОтчета.ПолучитьОбласть("ШапкаОтчета");
			ШапкаОтчета.Параметры.Филиал = СокрЛП(ТекБаза); 
			ШапкаОтчета.Параметры.ДатаОтчета = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
			ТаблДокРуководителя.Вывести(ШапкаОтчета);
			
			Для Каждого СтрокаРезультата Из ДанныеДляОтчетаРуководителю Цикл
				
				СтрокаОтчета = МакетОтчета.ПолучитьОбласть("СтрокаОтчета");
				СтрокаОтчета.Параметры.Заполнить(СтрокаРезультата);
				ТаблДокРуководителя.Вывести(СтрокаОтчета);			
				
			КонецЦикла;			
			
			ТаблДокРуководителя.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
			ТаблДокРуководителя.АвтоМасштаб = Истина; 
			
			СтруктураФайла = Новый Структура("ИмяВременногоФайла,ИмяДляОтправки", ПолучитьИмяВременногоФайла(".XLSX"), 
			                "Отчет по неотгруженным товарам сторонних складов (сводный) от " + Формат(ТекущаяДата(), "ДФ=dd_MM_yyyy") + ".XLSX");
			ТаблДокРуководителя.Записать(СтруктураФайла.ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
			
			ОтправитьПисьмо(СокрЛП(ДанныеДляОтчетаРуководителю[0].АдресЭлПочты), СтруктураФайла);
			
			Попытка	
				УдалитьФайлы(СтруктураФайла.ИмяВременногоФайла); 
			Исключение 
			КонецПопытки;
			
			СтруктураФайла.Очистить();
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Отправим отчеты ответственным менеджерам	
	ДанныедляОтчетаМенеджеров = ЗапросТоваров.Выполнить();
	
	Если НЕ ДанныедляОтчетаМенеджеров.Пустой() Тогда
		
		ВыборкаМенеджеров = ДанныедляОтчетаМенеджеров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаМенеджеров.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаМенеджеров.АдресЭлПочты) Тогда
				
				ТаблДокМенеджера = Новый ТабличныйДокумент;
				
				ШапкаОтчета = МакетОтчета.ПолучитьОбласть("ШапкаОтчета");
				ШапкаОтчета.Параметры.Филиал = СокрЛП(ТекБаза); 
				ШапкаОтчета.Параметры.ДатаОтчета = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
				ТаблДокМенеджера.Вывести(ШапкаОтчета);
				
				ВыборкаЗаказы = ВыборкаМенеджеров.Выбрать();
				
				Пока ВыборкаЗаказы.Следующий() Цикл
					
					СтрокаОтчета = МакетОтчета.ПолучитьОбласть("СтрокаОтчета");
					СтрокаОтчета.Параметры.Заполнить(ВыборкаЗаказы);
					ТаблДокМенеджера.Вывести(СтрокаОтчета);				
					
				КонецЦикла;		
				
				ТаблДокМенеджера.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
				ТаблДокМенеджера.АвтоМасштаб = Истина;
				
				СтруктураФайла = Новый Структура("ИмяВременногоФайла,ИмяДляОтправки", ПолучитьИмяВременногоФайла(".XLSX"), 
				                "Отчет по неотгруженным товарам сторонних складов от " + Формат(ТекущаяДата(), "ДФ=dd_MM_yyyy") + ".XLSX");
				ТаблДокМенеджера.Записать(СтруктураФайла.ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
				
				ОтправитьПисьмо(СокрЛП(ВыборкаМенеджеров.АдресЭлПочты),СтруктураФайла);
				
				Попытка	
					УдалитьФайлы(СтруктураФайла.ИмяВременногоФайла); 
				Исключение 
				КонецПопытки;
				
				СтруктураФайла.Очистить();
				
			КонецЕсли;	
			
		КонецЦикла; 
		
	КонецЕсли;
	
	УчетнаяЗапись = Неопределено;
	Почта = Неопределено;

КонецПроцедуры

Процедура ОтправитьПисьмо(АдресЭлПочты,СтруктураФайла)  
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Тема = "Отчет по неотгруженным товарам сторонних складов на " + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") + "";
	
	МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(АдресЭлПочты, ";");
	
	Для Каждого ТекАдрес Из МассивАдресов Цикл
		Сообщение.Получатели.Добавить(ТекАдрес); 
	КонецЦикла; 
	
	Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
	Сообщение.Вложения.Добавить(Новый ДвоичныеДанные(СтруктураФайла.ИмяВременногоФайла), СтруктураФайла.ИмяДляОтправки);
	
	Попытка
		
		Почта.Послать(Сообщение);
		ТекстСообщения = "Отправлен отчета по неотгруженным товарам сторонних складов на адрес : " + АдресЭлПочты;
		ЗаписьЖурналаРегистрации("Отправка отчета по неотгруженным товарам сторонних складов.Успешно", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
		
	Исключение
		
		ТекстСообщения = "Не отправлен отчета по неотгруженным товарам сторонних складов на адрес : " + АдресЭлПочты;
		ЗаписьЖурналаРегистрации("Отправка отчета по неотгруженным товарам сторонних складов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		
	КонецПопытки;
	
	Сообщение.Получатели.Очистить();
	Сообщение.Вложения.Очистить();	

КонецПроцедуры
